In [1]:
import pandas as pd

In [ ]:
df = pd.read_csv("sales_data_sample.csv",encoding="latin1")

In [ ]:
print(df)

# Create file for using Pandas

In [52]:
import pandas as pd

data = {
    "Name": ['shahroz', 'Areeba', 'Umar'],
    "Age": [25, 24, 22],
    "City": ['Karachi', 'Karachi', 'Shahdadpur']
}

df1 = pd.DataFrame(data)
print(df1)

      Name  Age        City
0  shahroz   25     Karachi
1   Areeba   24     Karachi
2     Umar   22  Shahdadpur

In [ ]:
df1.to_csv("output.csv", index=False)

In [ ]:
df1.to_excel("output.xlsx", index=False)

In [ ]:
df1 = pd.read_excel("output.xlsx")
print(df1)


*   Head(5)
*   Tail(10)
* Using data set for sales_data_sample

In [ ]:
df = pd.read_csv("sales_data_sample.csv",encoding="latin1")

In [ ]:
print("Display 10 row of First")
print(df.head(10))
print("Display 10 row of last")
print(df.tail(10))

In [ ]:
print("Display the info of data set")
print(df.info())

# Employee Data

In [2]:
import  pandas as pd
df2 = pd.read_csv("employee_data.csv")

In [13]:
print(df2)

   Employee ID                       Name        Department  Age  \
0       EPK000  Rao Muhammad Shahroz Khan      Data Analyst   27
1       EPK001                 Ahmed Khan             Sales   28
2       EPK002                 Sara Malik                HR   32
3       EPK003              Bilal Hussain                IT   26
4       EPK004            Ayesha Siddiqui         Marketing   29
5       EPK005                 Farhan Ali           Finance   35
6       EPK006               Zainab Javed  Customer Support   24
7       EPK007              Imran Qureshi                IT   31
8       EPK008               Maryam Saeed                HR   27
9       EPK009                Hamza Tariq             Sales   33
10      EPK010                 Rabia Khan           Finance   30
11      EPK011              Shahbaz Ahmed         Logistics   36
12      EPK012                 Sana Iqbal         Marketing   25
13      EPK013                 Waqas Raza                IT   29
14      EPK014                Hira Farooq                HR   34
15      EPK015             Faisal Mehmood           Finance   38
16      EPK016                Komal Zafar  Customer Support   26
17      EPK017               Kashif Anwar             Sales   32
18      EPK018                  Sadaf Gul         Marketing   28
19      EPK019              Zeeshan Malik         Logistics   35
20      EPK020             Mahnoor Shahid                IT   27
21      EPK021                   Ali Raza           Finance   40
22      EPK022              Nadia Hussain                HR   29
23      EPK023               Adnan Shafiq             Sales   33
24      EPK024                Noor Fatima  Customer Support   25
25      EPK025               Usman Akhtar                IT   31
26      EPK026              Mehwish Rafiq         Marketing   28
27      EPK027               Shahid Nawaz         Logistics   37
28      EPK028               Aiman Khalid                HR   26
29      EPK029               Danish Iqbal           Finance   34

    Salary (PKR)  Performance Score        City
0         115000                8.5  Shahdadpur
1          85000                8.2     Karachi
2          95000                7.8      Lahore
3         120000                9.0   Islamabad
4          88000                8.5     Karachi
5         150000                9.3      Lahore
6          55000                7.0  Faisalabad
7         140000                8.9   Islamabad
8          82000                8.0      Multan
9         110000                8.6     Karachi
10        135000                8.7      Lahore
11         75000                7.4    Peshawar
12         70000                7.5     Karachi
13        125000                8.8   Islamabad
14         98000                8.1      Lahore
15        165000                9.1     Karachi
16         60000                7.3      Multan
17        100000                8.2      Lahore
18         85000                8.0     Karachi
19         78000                7.6   Islamabad
20        118000                8.7      Lahore
21        170000                9.4     Karachi
22         90000                8.3   Islamabad
23        105000                8.5  Faisalabad
24         58000                7.2      Lahore
25        130000                8.9     Karachi
26         83000                8.1      Lahore
27         80000                7.7     Karachi
28         85000                8.2   Islamabad
29        140000                8.8      Multan

In [2]:
print('Descriptive Statistics')
print(df2.describe())

Descriptive Statistics
           Index        Age   Salary (PKR)  Performance Score
count  30.000000  30.000000      30.000000          30.000000
mean   14.500000  30.500000  103000.000000           8.276667
std     8.803408   4.264933   30927.055447           0.638254
min     0.000000  24.000000   55000.000000           7.000000
25%     7.250000  27.000000   82250.000000           7.850000
50%    14.500000  29.500000   96500.000000           8.250000
75%    21.750000  33.750000  123750.000000           8.775000
max    29.000000  40.000000  170000.000000           9.400000

In [3]:
print('shape',df2.shape)
print('Column Name',df2.columns)

shape (30, 8)
Column Name Index(['Index', 'Employee ID', 'Name', 'Department', 'Age', 'Salary (PKR)',
       'Performance Score', 'City'],
      dtype='object')

In [ ]:
name = df2['Name']
print(name)

In [ ]:
subset = df2[['Name','Salary (PKR)']]
print('\nSubset With Name and Salary')
print(subset)

# How to Apply condition form Data set

In [ ]:
high_salary = df2[df2['Salary (PKR)'] > 100000]
print("Employees Whith salary > 100000")
print(high_salary)

In [14]:
filtered = df2[(df2["Age"] > 30) & (df2["Salary (PKR)"] > 100000 )]
print(filtered)

    Index Employee ID            Name Department  Age  Salary (PKR)  \
5       5      EPK005      Farhan Ali    Finance   35        150000
7       7      EPK007   Imran Qureshi         IT   31        140000
9       9      EPK009     Hamza Tariq      Sales   33        110000
15     15      EPK015  Faisal Mehmood    Finance   38        165000
21     21      EPK021        Ali Raza    Finance   40        170000
23     23      EPK023    Adnan Shafiq      Sales   33        105000
25     25      EPK025    Usman Akhtar         IT   31        130000
29     29      EPK029    Danish Iqbal    Finance   34        140000

    Performance Score        City
5                 9.3      Lahore
7                 8.9   Islamabad
9                 8.6     Karachi
15                9.1     Karachi
21                9.4     Karachi
23                8.5  Faisalabad
25                8.9     Karachi
29                8.8      Multan

In [ ]:
#filtered1 = df2[(df2["Age"] > 33) | (df2["Performance Score"] > 9.0) & (df2["Salary (PKR)"] > 130000)]
filtered1 = df2[((df2["Age"] > 33) | (df2["Performance Score"] > 9.0)) & (df2["Salary (PKR)"] > 130000)]
print(filtered1)

    Index Employee ID            Name Department  Age  Salary (PKR)  \
5       5      EPK005      Farhan Ali    Finance   35        150000
15     15      EPK015  Faisal Mehmood    Finance   38        165000
21     21      EPK021        Ali Raza    Finance   40        170000
29     29      EPK029    Danish Iqbal    Finance   34        140000

    Performance Score     City
5                 9.3   Lahore
15                9.1  Karachi
21                9.4  Karachi
29                8.8   Multan

In [ ]:
filtered2 = df2[((df2["Age"] > 26) | (df2["Performance Score"] > 9.0)) & (df2["Salary (PKR)"] > 110000)][['Name','City','Department','Salary (PKR)']]
print(filtered2)

# How to add New Column form data set

In [ ]:
print(df2)
df2["Incentive"] = df2['Salary (PKR)'] * 0.1
print(df2)

using insert()

df.insert(loc,Column_Name,some_data)

 # How to Update Data form Data Set

In [ ]:
# df.loc[]
# df.loc[row_index, "Column Name"] = new_value
print(df2)
df2.loc[0, 'Salary (PKR)'] = 80000
print(df2)

# How to Removing Column and Row form Data Set

In [12]:
import  pandas as pd
df2 = pd.read_csv("employee_data.csv")
print(df2)
# df.drop(Columns = ["Columns Name"], implace = True)
print("Modified Data Set")
df2.drop(columns=["Index"], inplace=True)
print(df2)

    Index Employee ID                       Name        Department  Age  \
0       0      EPK000  Rao Muhammad Shahroz Khan      Data Analyst   27
1       1      EPK001                 Ahmed Khan             Sales   28
2       2      EPK002                 Sara Malik                HR   32
3       3      EPK003              Bilal Hussain                IT   26
4       4      EPK004            Ayesha Siddiqui         Marketing   29
5       5      EPK005                 Farhan Ali           Finance   35
6       6      EPK006               Zainab Javed  Customer Support   24
7       7      EPK007              Imran Qureshi                IT   31
8       8      EPK008               Maryam Saeed                HR   27
9       9      EPK009                Hamza Tariq             Sales   33
10     10      EPK010                 Rabia Khan           Finance   30
11     11      EPK011              Shahbaz Ahmed         Logistics   36
12     12      EPK012                 Sana Iqbal         Marketing   25
13     13      EPK013                 Waqas Raza                IT   29
14     14      EPK014                Hira Farooq                HR   34
15     15      EPK015             Faisal Mehmood           Finance   38
16     16      EPK016                Komal Zafar  Customer Support   26
17     17      EPK017               Kashif Anwar             Sales   32
18     18      EPK018                  Sadaf Gul         Marketing   28
19     19      EPK019              Zeeshan Malik         Logistics   35
20     20      EPK020             Mahnoor Shahid                IT   27
21     21      EPK021                   Ali Raza           Finance   40
22     22      EPK022              Nadia Hussain                HR   29
23     23      EPK023               Adnan Shafiq             Sales   33
24     24      EPK024                Noor Fatima  Customer Support   25
25     25      EPK025               Usman Akhtar                IT   31
26     26      EPK026              Mehwish Rafiq         Marketing   28
27     27      EPK027               Shahid Nawaz         Logistics   37
28     28      EPK028               Aiman Khalid                HR   26
29     29      EPK029               Danish Iqbal           Finance   34

    Salary (PKR)  Performance Score        City
0         115000                8.5  Shahdadpur
1          85000                8.2     Karachi
2          95000                7.8      Lahore
3         120000                9.0   Islamabad
4          88000                8.5     Karachi
5         150000                9.3      Lahore
6          55000                7.0  Faisalabad
7         140000                8.9   Islamabad
8          82000                8.0      Multan
9         110000                8.6     Karachi
10        135000                8.7      Lahore
11         75000                7.4    Peshawar
12         70000                7.5     Karachi
13        125000                8.8   Islamabad
14         98000                8.1      Lahore
15        165000                9.1     Karachi
16         60000                7.3      Multan
17        100000                8.2      Lahore
18         85000                8.0     Karachi
19         78000                7.6   Islamabad
20        118000                8.7      Lahore
21        170000                9.4     Karachi
22         90000                8.3   Islamabad
23        105000                8.5  Faisalabad
24         58000                7.2      Lahore
25        130000                8.9     Karachi
26         83000                8.1      Lahore
27         80000                7.7     Karachi
28         85000                8.2   Islamabad
29        140000                8.8      Multan
Modified Data Set
   Employee ID                       Name        Department  Age  \
0       EPK000  Rao Muhammad Shahroz Khan      Data Analyst   27
1       EPK001                 Ahmed Khan             Sales   28
2       EPK002                 Sara Malik                HR   32
3       EPK003              Bilal Hussain                IT   26
4       EPK004            Ayesha Siddiqui         Marketing   29
5       EPK005                 Farhan Ali           Finance   35
6       EPK006               Zainab Javed  Customer Support   24
7       EPK007              Imran Qureshi                IT   31
8       EPK008               Maryam Saeed                HR   27
9       EPK009                Hamza Tariq             Sales   33
10      EPK010                 Rabia Khan           Finance   30
11      EPK011              Shahbaz Ahmed         Logistics   36
12      EPK012                 Sana Iqbal         Marketing   25
13      EPK013                 Waqas Raza                IT   29
14      EPK014                Hira Farooq                HR   34
15      EPK015             Faisal Mehmood           Finance   38
16      EPK016                Komal Zafar  Customer Support   26
17      EPK017               Kashif Anwar             Sales   32
18      EPK018                  Sadaf Gul         Marketing   28
19      EPK019              Zeeshan Malik         Logistics   35
20      EPK020             Mahnoor Shahid                IT   27
21      EPK021                   Ali Raza           Finance   40
22      EPK022              Nadia Hussain                HR   29
23      EPK023               Adnan Shafiq             Sales   33
24      EPK024                Noor Fatima  Customer Support   25
25      EPK025               Usman Akhtar                IT   31
26      EPK026              Mehwish Rafiq         Marketing   28
27      EPK027               Shahid Nawaz         Logistics   37
28      EPK028               Aiman Khalid                HR   26
29      EPK029               Danish Iqbal           Finance   34

    Salary (PKR)  Performance Score        City
0         115000                8.5  Shahdadpur
1          85000                8.2     Karachi
2          95000                7.8      Lahore
3         120000                9.0   Islamabad
4          88000                8.5     Karachi
5         150000                9.3      Lahore
6          55000                7.0  Faisalabad
7         140000                8.9   Islamabad
8          82000                8.0      Multan
9         110000                8.6     Karachi
10        135000                8.7      Lahore
11         75000                7.4    Peshawar
12         70000                7.5     Karachi
13        125000                8.8   Islamabad
14         98000                8.1      Lahore
15        165000                9.1     Karachi
16         60000                7.3      Multan
17        100000                8.2      Lahore
18         85000                8.0     Karachi
19         78000                7.6   Islamabad
20        118000                8.7      Lahore
21        170000                9.4     Karachi
22         90000                8.3   Islamabad
23        105000                8.5  Faisalabad
24         58000                7.2      Lahore
25        130000                8.9     Karachi
26         83000                8.1      Lahore
27         80000                7.7     Karachi
28         85000                8.2   Islamabad
29        140000                8.8      Multan

# How to Missing Data Handling Form New Data Set

In [ ]:
import pandas as pd
data = {
    "Name":['Shahroz','Areeba','None','Umar','Usman','Huriya','Jahanzaib','None','Zeeyan','Meerab'],
    "Age" :[26,24,None,22,21,19,15,None,12,10],
    "Salary":[60000,50000,None,45000,41000,39000,32000,None,29000,25000],
    "Performance_score" :[89,80,None,75,90,92,82,None,76,72]
}
df3 = pd.DataFrame(data)
print(df3)

Check Data Set Null Value For Using Keywork = "df.isnull()"

In [17]:
print(df3.isnull())

    Name    Age  Salary  Performance_score
0  False  False   False              False
1  False  False   False              False
2  False   True    True               True
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
7  False   True    True               True
8  False  False   False              False
9  False  False   False              False

Check Data Set Nmber of Value Integer For Using Keywork = "df.isnull().sum()"

In [18]:
print(df3.isnull().sum())

Name                 0
Age                  2
Salary               2
Performance_score    2
dtype: int64

 Missing Data Drop For New Data Set

In [ ]:
import pandas as pd
data = {
    "Name":['Shahroz','Areeba','None','Umar','Usman','Huriya','Jahanzaib','None','Zeeyan','Meerab'],
    "Age" :[26,24,None,22,21,19,15,None,12,10],
    "Salary":[60000,50000,None,45000,41000,39000,32000,None,29000,25000],
    "Performance_score" :[89,80,None,75,90,92,82,None,76,72]
}
df_drop = pd.DataFrame(data)
print(df_drop)

In [ ]:
print(df_drop)
df_drop.dropna(inplace=True)
print(df_drop)

Fill up data form Null Value New data set using Keyword = "fillna"

In [39]:
import pandas as pd
data = {
    "Name":['Shahroz','Areeba','None','Umar','Usman','Huriya','Jahanzaib','None','Zeeyan','Meerab'],
    "Age" :[26,24,None,22,21,19,15,None,12,10],
    "Salary":[60000,50000,None,45000,41000,39000,32000,None,29000,25000],
    "Performance_score" :[89,80,None,75,90,92,82,None,76,72]
}
df_fill = pd.DataFrame(data)
print(df_fill)

        Name   Age   Salary  Performance_score
0    Shahroz  26.0  60000.0               89.0
1     Areeba  24.0  50000.0               80.0
2       None   NaN      NaN                NaN
3       Umar  22.0  45000.0               75.0
4      Usman  21.0  41000.0               90.0
5     Huriya  19.0  39000.0               92.0
6  Jahanzaib  15.0  32000.0               82.0
7       None   NaN      NaN                NaN
8     Zeeyan  12.0  29000.0               76.0
9     Meerab  10.0  25000.0               72.0

Fill up defualt value in to 0

In [ ]:
print(df_fill)
df_fill.fillna(0,inplace=True)
print("Updating Data")
print(df_fill)

In [40]:
df_fill['Age'].fillna(df_fill['Age'].mean(), inplace=True)
df_fill['Salary'].fillna(df_fill['Salary'].mean(), inplace=True)
#df_fill['Perfomance_score'].fillna(df_fill['Perfomance_score'].mean(), inplace=True)
print(df_fill)

        Name     Age   Salary  Performance_score
0    Shahroz  26.000  60000.0               89.0
1     Areeba  24.000  50000.0               80.0
2       None  18.625  40125.0                NaN
3       Umar  22.000  45000.0               75.0
4      Usman  21.000  41000.0               90.0
5     Huriya  19.000  39000.0               92.0
6  Jahanzaib  15.000  32000.0               82.0
7       None  18.625  40125.0                NaN
8     Zeeyan  12.000  29000.0               76.0
9     Meerab  10.000  25000.0               72.0

C:\Users\princ\AppData\Local\Temp\ipykernel_3620\2410397604.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_fill['Age'].fillna(df_fill['Age'].mean(), inplace=True)
C:\Users\princ\AppData\Local\Temp\ipykernel_3620\2410397604.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_fill['Salary'].fillna(df_fill['Salary'].mean(), inplace=True)

# Interpolation Method

Haan üëç interpolation ka matlab hota hai missing values ko estimate karke fill karna, taki data continuous ban jaye.

üîπ Simple shabdon me: agar aapke paas ek dataset hai jisme kuch values missing hain, to interpolation un gaps ko logical tareeqe se bhar deta hai.

For example:üëáüëáüëá

In [15]:
import pandas as pd

data = {
    "Time" : [1,2,3,4,5],
    "Value": [10,None,30,None,50]
}
df_inter = pd.DataFrame(data)
print("Before Interpolation")
print(df_inter)
# Method linear

Before Interpolation
   Time  Value
0     1   10.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0

1. üîπ Linear Interpolation Kya Hai?

Linear interpolation ka matlab hai do known points ke darmiyan ek straight line kheench kar missing value ka andaza lagana.

Aap bas dono endpoints ka average trend follow karte ho.

In [16]:
df_inter['Value'] = df_inter['Value'].interpolate(method="linear")
print("After Interpolation")
print(df_inter)

After Interpolation
   Time  Value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

2. üîπ Polynomial Interpolation Kya Hai?

Polynomial interpolation ka matlab hai missing values ko straight line ke bajaye ek polynomial curve (quadratic, cubic, etc.) ke hisaab se estimate karna.

üëâ Matlab agar data me straight line ka trend na ho, aur thoda curve ho, to polynomial interpolation better fit deta hai.

üîπ Linear ‚Üí seedha line ke hisaab se fill karta hai.
üîπ Polynomial (order=2,3,...) ‚Üí ek smooth curve follow karta hai.

üëâ Polynomial interpolation zyada useful hota hai jab data naturally curved trend follow karta hai (jaise population growth, physics experiments, etc.).

![alt text](<../linear vs polynomial compare.png>)

Yeh dekhiye üìä ‚Äî graph me comparison:

üî¥ Red ‚Üí Original data (jahan values missing thi, wahan gap hai).

üîµ Blue ‚Üí Linear interpolation (seedhi line se gap fill kiya).

üü¢ Green ‚Üí Polynomial interpolation (order=2, yani quadratic curve se fill kiya).

üëâ Isse clearly dikh raha hai ki polynomial zyada smooth aur curve ke hisaab se estimate karta hai, jabki linear sirf straight line ke saath fill karta hai.

3. üîπ Time-based Interpolation kya hai?

Ye tab use hota hai jab aapke dataset ka index ek DateTime index hota hai.
üëâ Matlab agar aapke data me time-series ho (jaise dates/timestamps), to pandas missing values ko time difference ke hisaab se fill karega.

‚úÖ Difference ye hai ki time-based interpolation specifically datetime index ka use karta hai.
Ye linear ke jaisa lagta hai, lekin agar dates irregular hain (jaise 1 Jan, 5 Jan, 10 Jan), to ye missing values ko unke beech ke time gap ke proportion ke hisaab se fill karega

Expected Difference:

Linear interpolation ‚Üí bas row numbers ke hisaab se equally distribute karega.

Time-based interpolation ‚Üí dates ke beech ke time gap ko consider karega.

üëâ For example,

2023-01-03 value linear ke hisaab se 20 ban sakti hai,

Lekin time-based me wo thoda adjust hoga kyunki 2023-01-03 aur 2023-01-06 ke beech 3 din ka gap hai, jabki 2023-01-06 aur 2023-01-15 ke beech 9 din ka gap hai.

# Sorting & Aggregation

Sorting Data 1 Column Sort_values()

In [9]:
import pandas as pd

data = {
    "Name":['shahroz','Areeba','Meerab'],
    "Score_point": [8.9,9.6,8.0],
    "Salary":[10000,30000,5000]
}

df_sort = pd.DataFrame(data)
df_sort.sort_values(by=["Score_point","Salary"], ascending=False,inplace=True)
print(df_sort)

      Name  Score_point  Salary
1   Areeba          9.6   30000
0  shahroz          8.9   10000
2   Meerab          8.0    5000

üîπ Summary Statistics kya hota hai?

Ye wo basic numerical values hain jo data ko summarize karte hain ‚Äî yani bade dataset ko ek chhoti si summary me explain kar dete hain.

Isme mainly teen categories hoti hain:

1. Measures of Central Tendency (Data ka center)

Mean (Average) ‚Üí sab numbers ka average

Median ‚Üí beech wala number jab data ko sort karte hain

Mode ‚Üí jo value sabse zyada repeat hoti hai

2. Measures of Dispersion (Data kitna spread hai)

Range ‚Üí max - min

Variance ‚Üí data ka spread (squared differences from mean)

Standard Deviation (std) ‚Üí data kitna mean se door hai (spread measure)

3. Shape of Data Distribution

Skewness ‚Üí data left/right skew hai ya symmetric

Kurtosis ‚Üí tails heavy hain ya light (normal distribution se compare karke)

In [15]:
import pandas as pd

data = {
    "Name":['shahroz','Areeba','Meerab'],
    "Score_point": [8.9,9.6,8.0],
    "Salary":[10000,30000,5000]
}

df_avg = pd.DataFrame(data)
avg_salary = df_avg['Salary'].mean()
print(avg_salary)

15000.0

üîπ Pandas groupby kya hota hai?

groupby ka use tab hota hai jab aap data ko ek ya zyada categories ke basis par group karke un groups par aggregation / summary statistics lagana chahte ho.

Matlab:

Ek bade dataset ko chhote-chhote groups me tod kar har group par calculation karna.

In [21]:
import pandas as pd

data = {
    "Student":['Ali','Ali','Sara','Sara','shahroz','Shahroz','Areeba','Areeba'],
    "Class"  :[10,10,10,10,9,9,9,9],
    "Subject":['Math','Science','Math','Science','Math','Science','Math','Science'],
    "Marks"  :[85,75,95,69,70,80,90,67]
}

df_std = pd.DataFrame(data)
print(df_std)

grouped = df_std.groupby("Class")["Marks"].max()
print(grouped)

   Student  Class  Subject  Marks
0      Ali     10     Math     85
1      Ali     10  Science     75
2     Sara     10     Math     95
3     Sara     10  Science     69
4  shahroz      9     Math     70
5  Shahroz      9  Science     80
6   Areeba      9     Math     90
7   Areeba      9  Science     67
Class
9     90
10    95
Name: Marks, dtype: int64

Multiple Grouping

In [24]:
Multi_group = df_std.groupby(["Class","Marks"])["Student"].sum()
print(Multi_group)

Class  Marks
9      67        Areeba
       70       shahroz
       80       Shahroz
       90        Areeba
10     69          Sara
       75           Ali
       85           Ali
       95          Sara
Name: Student, dtype: object

Common Aggregation Funtion
1. sum()
2. mean()
3. count()
4. min()
5. max()
6. std()

# Marging & Joining

üìå Merging ka matlab hota hai 2 ya zyada data sets ko join karna ek common column ke basis par. Ye SQL ke joins (INNER, LEFT, RIGHT, OUTER) jaise kaam karta hai.

In [17]:
import pandas as pd

#Customer DataFrame
data = {
    "CustomerID" : [1,2,3,4,5,6],
    "C_Name"     : ['Shahroz','Umar','Areeba','Wajahat','Maryam','Nimra']
}
#Order DataFrame
data1 = {
    "CustomerID" : [1,2,3,4,5,6],
    "product_name":["Laptop","Smartphone","Headphones","Keyboard","Mouse","Smartwatch"],
    "OrderAmount": [80000, 50000, 7000, 3500, 1500, 12000]
}

df_customer = pd.DataFrame(data)
print(df_customer)
df_order = pd.DataFrame(data1)
print("")
print(df_order)

   CustomerID   C_Name
0           1  Shahroz
1           2     Umar
2           3   Areeba
3           4  Wajahat
4           5   Maryam
5           6    Nimra

   CustomerID product_name  OrderAmount
0           1       Laptop        80000
1           2   Smartphone        50000
2           3   Headphones         7000
3           4     Keyboard         3500
4           5        Mouse         1500
5           6   Smartwatch        12000

Apply for Marging Inner Join

In [18]:
df_marged = pd.merge(df_customer,df_order, on="CustomerID",how="inner")
print("Inner Join")
print(df_marged)

Inner Join
   CustomerID   C_Name product_name  OrderAmount
0           1  Shahroz       Laptop        80000
1           2     Umar   Smartphone        50000
2           3   Areeba   Headphones         7000
3           4  Wajahat     Keyboard         3500
4           5   Maryam        Mouse         1500
5           6    Nimra   Smartwatch        12000

Apply for Marging Outer Join

In [19]:
df_marged_outer = pd.merge(df_customer,df_order,on="CustomerID",how="outer")
print(df_marged_outer)

   CustomerID   C_Name product_name  OrderAmount
0           1  Shahroz       Laptop        80000
1           2     Umar   Smartphone        50000
2           3   Areeba   Headphones         7000
3           4  Wajahat     Keyboard         3500
4           5   Maryam        Mouse         1500
5           6    Nimra   Smartwatch        12000

üîπ Concatenation ka matlab hota hai do ya zyada DataFrames / Series ko jodna ‚Äî row-wise ya column-wise.
Ye Python ke pandas.concat() function se hota hai.

üîë Summary:

axis=0 ‚Üí rows concatenate (default)

axis=1 ‚Üí columns concatenate

In [ ]:
import pandas as pd

#Region1
df_DSet1 = pd.DataFrame({
    'Roll_no' : [1,2,3],
    'S_Name'  : ['Wajahat','Meerab','Zeeyan']
})

#Region1
df_DSet2 = pd.DataFrame({
    'Roll_no' : [4,5,6],
    'S_Name'  : ['Shahroz','Nimra','Sidra']
})

‚Üï Vertically Concatenate

In [29]:
df_vertical_concate = pd.concat([df_DSet1, df_DSet2], ignore_index=True)
print(df_vertical_concate)

   Roll_no   S_Name
0        1  Shahroz
1        2   Meerab
2        3   Zeeyan
3        4  Wajahat
4        5    Nimra
5        6    Sidra

‚Üî Horizontal Concatenate

Only Add "axis=1"

In [30]:
df_horizontal_concate = pd.concat([df_DSet1, df_DSet2],axis=1, ignore_index=True)
print(df_horizontal_concate)

   0        1  2        3
0  1  Shahroz  4  Wajahat
1  2   Meerab  5    Nimra
2  3   Zeeyan  6    Sidra